results_stress.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 3m0s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 2m30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 0008/1000 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 0008/1000 VUs  0m01.0s/2m30.0s

running (0m02.0s), 0017/1000 VUs, 8 complete and 0 interrupted iterations
default   [   1% ] 0017/1000 VUs  0m02.0s/2m30.0s

running (0m03.0s), 0025/1000 VUs, 21 complete and 0 interrupted iterations
default   [   2% ] 0025/1000 VUs  0m03.0s/2m30.0s

running (0m03.9s), 0033/1000 VUs, 36 complete and 0 interrupted iterations
default   [   3% ] 0033/1000 VUs  0m03.9s/2m30.0s

running (0m04.9s), 0042/1000 VUs, 51 complete and 0 interrupted iterations
default   [   3% ] 0042/1000 VUs  0m04.9s/2m30.0s

running (0m06.0s), 0050/1000 VUs, 65 complete and 0 interrupted iterations
default   [   4% ] 0050/1000 VUs  0m06.0s/2m30.0s

running (0m06.9s), 0058/1000 VUs, 80 complete and 0 interrupted iterations
default   [   5% ] 0058/1000 VUs  0m06.9s/2m30.0s

running (0m08.0s), 0067/1000 VUs, 94 complete and 0 interrupted iterations
default   [   5% ] 0067/1000 VUs  0m08.0s/2m30.0s

running (0m09.0s), 0075/1000 VUs, 109 complete and 0 interrupted iterations
default   [   6% ] 0075/1000 VUs  0m09.0s/2m30.0s

running (0m10.0s), 0083/1000 VUs, 124 complete and 0 interrupted iterations
default   [   7% ] 0083/1000 VUs  0m10.0s/2m30.0s

running (0m11.0s), 0092/1000 VUs, 138 complete and 0 interrupted iterations
default   [   7% ] 0092/1000 VUs  0m11.0s/2m30.0s

running (0m12.0s), 0100/1000 VUs, 153 complete and 0 interrupted iterations
default   [   8% ] 0100/1000 VUs  0m12.0s/2m30.0s

running (0m12.9s), 0108/1000 VUs, 168 complete and 0 interrupted iterations
default   [   9% ] 0108/1000 VUs  0m12.9s/2m30.0s

running (0m14.0s), 0117/1000 VUs, 181 complete and 0 interrupted iterations
default   [   9% ] 0117/1000 VUs  0m14.0s/2m30.0s

running (0m14.9s), 0125/1000 VUs, 195 complete and 0 interrupted iterations
default   [  10% ] 0125/1000 VUs  0m14.9s/2m30.0s

running (0m15.9s), 0133/1000 VUs, 210 complete and 0 interrupted iterations
default   [  11% ] 0133/1000 VUs  0m15.9s/2m30.0s

running (0m17.0s), 0142/1000 VUs, 224 complete and 0 interrupted iterations
default   [  11% ] 0142/1000 VUs  0m17.0s/2m30.0s

running (0m18.0s), 0150/1000 VUs, 239 complete and 0 interrupted iterations
default   [  12% ] 0150/1000 VUs  0m17.9s/2m30.0s

running (0m19.0s), 0158/1000 VUs, 252 complete and 0 interrupted iterations
default   [  13% ] 0158/1000 VUs  0m19.0s/2m30.0s

running (0m19.9s), 0167/1000 VUs, 265 complete and 0 interrupted iterations
default   [  13% ] 0167/1000 VUs  0m19.9s/2m30.0s

running (0m21.0s), 0175/1000 VUs, 275 complete and 0 interrupted iterations
default   [  14% ] 0175/1000 VUs  0m21.0s/2m30.0s

running (0m21.9s), 0183/1000 VUs, 288 complete and 0 interrupted iterations
default   [  15% ] 0183/1000 VUs  0m21.9s/2m30.0s

running (0m22.9s), 0192/1000 VUs, 302 complete and 0 interrupted iterations
default   [  15% ] 0192/1000 VUs  0m22.9s/2m30.0s

running (0m23.9s), 0200/1000 VUs, 316 complete and 0 interrupted iterations
default   [  16% ] 0200/1000 VUs  0m23.9s/2m30.0s

running (0m25.0s), 0208/1000 VUs, 330 complete and 0 interrupted iterations
default   [  17% ] 0208/1000 VUs  0m25.0s/2m30.0s

running (0m25.9s), 0217/1000 VUs, 344 complete and 0 interrupted iterations
default   [  17% ] 0217/1000 VUs  0m25.9s/2m30.0s

running (0m27.0s), 0225/1000 VUs, 358 complete and 0 interrupted iterations
default   [  18% ] 0225/1000 VUs  0m27.0s/2m30.0s

running (0m28.0s), 0233/1000 VUs, 371 complete and 0 interrupted iterations
default   [  19% ] 0233/1000 VUs  0m28.0s/2m30.0s

running (0m28.9s), 0242/1000 VUs, 385 complete and 0 interrupted iterations
default   [  19% ] 0242/1000 VUs  0m28.9s/2m30.0s

running (0m30.0s), 0250/1000 VUs, 398 complete and 0 interrupted iterations
default   [  20% ] 0250/1000 VUs  0m30.0s/2m30.0s

running (0m31.0s), 0258/1000 VUs, 412 complete and 0 interrupted iterations
default   [  21% ] 0258/1000 VUs  0m31.0s/2m30.0s

running (0m31.9s), 0266/1000 VUs, 426 complete and 0 interrupted iterations
default   [  21% ] 0266/1000 VUs  0m31.9s/2m30.0s

running (0m32.9s), 0275/1000 VUs, 441 complete and 0 interrupted iterations
default   [  22% ] 0275/1000 VUs  0m32.9s/2m30.0s

running (0m33.9s), 0283/1000 VUs, 455 complete and 0 interrupted iterations
default   [  23% ] 0283/1000 VUs  0m33.9s/2m30.0s

running (0m35.0s), 0291/1000 VUs, 469 complete and 0 interrupted iterations
default   [  23% ] 0291/1000 VUs  0m35.0s/2m30.0s

running (0m36.0s), 0300/1000 VUs, 484 complete and 0 interrupted iterations
default   [  24% ] 0300/1000 VUs  0m36.0s/2m30.0s

running (0m37.0s), 0308/1000 VUs, 498 complete and 0 interrupted iterations
default   [  25% ] 0308/1000 VUs  0m37.0s/2m30.0s

running (0m38.0s), 0316/1000 VUs, 513 complete and 0 interrupted iterations
default   [  25% ] 0316/1000 VUs  0m38.0s/2m30.0s

running (0m39.0s), 0325/1000 VUs, 527 complete and 0 interrupted iterations
default   [  26% ] 0325/1000 VUs  0m39.0s/2m30.0s

running (0m40.0s), 0333/1000 VUs, 547 complete and 0 interrupted iterations
default   [  27% ] 0333/1000 VUs  0m40.0s/2m30.0s

running (0m41.0s), 0341/1000 VUs, 570 complete and 0 interrupted iterations
default   [  27% ] 0341/1000 VUs  0m41.0s/2m30.0s

running (0m42.0s), 0350/1000 VUs, 590 complete and 0 interrupted iterations
default   [  28% ] 0350/1000 VUs  0m41.9s/2m30.0s

running (0m42.9s), 0358/1000 VUs, 613 complete and 0 interrupted iterations
default   [  29% ] 0358/1000 VUs  0m42.9s/2m30.0s

running (0m44.0s), 0366/1000 VUs, 635 complete and 0 interrupted iterations
default   [  29% ] 0366/1000 VUs  0m43.9s/2m30.0s

running (0m45.0s), 0375/1000 VUs, 657 complete and 0 interrupted iterations
default   [  30% ] 0375/1000 VUs  0m44.9s/2m30.0s

running (0m45.9s), 0383/1000 VUs, 679 complete and 0 interrupted iterations
default   [  31% ] 0383/1000 VUs  0m45.9s/2m30.0s

running (0m47.0s), 0391/1000 VUs, 702 complete and 0 interrupted iterations
default   [  31% ] 0391/1000 VUs  0m47.0s/2m30.0s

running (0m47.9s), 0400/1000 VUs, 724 complete and 0 interrupted iterations
default   [  32% ] 0400/1000 VUs  0m47.9s/2m30.0s

running (0m48.9s), 0408/1000 VUs, 748 complete and 0 interrupted iterations
default   [  33% ] 0408/1000 VUs  0m48.9s/2m30.0s

running (0m50.0s), 0416/1000 VUs, 770 complete and 0 interrupted iterations
default   [  33% ] 0416/1000 VUs  0m50.0s/2m30.0s

running (0m51.0s), 0425/1000 VUs, 791 complete and 0 interrupted iterations
default   [  34% ] 0425/1000 VUs  0m51.0s/2m30.0s

running (0m52.0s), 0433/1000 VUs, 814 complete and 0 interrupted iterations
default   [  35% ] 0433/1000 VUs  0m52.0s/2m30.0s

running (0m53.0s), 0441/1000 VUs, 836 complete and 0 interrupted iterations
default   [  35% ] 0441/1000 VUs  0m53.0s/2m30.0s

running (0m54.0s), 0450/1000 VUs, 858 complete and 0 interrupted iterations
default   [  36% ] 0450/1000 VUs  0m54.0s/2m30.0s

running (0m55.0s), 0458/1000 VUs, 879 complete and 0 interrupted iterations
default   [  37% ] 0458/1000 VUs  0m55.0s/2m30.0s

running (0m56.0s), 0466/1000 VUs, 902 complete and 0 interrupted iterations
default   [  37% ] 0466/1000 VUs  0m55.9s/2m30.0s

running (0m57.0s), 0475/1000 VUs, 923 complete and 0 interrupted iterations
default   [  38% ] 0475/1000 VUs  0m57.0s/2m30.0s

running (0m58.0s), 0483/1000 VUs, 946 complete and 0 interrupted iterations
default   [  39% ] 0483/1000 VUs  0m58.0s/2m30.0s

running (0m58.9s), 0491/1000 VUs, 975 complete and 0 interrupted iterations
default   [  39% ] 0491/1000 VUs  0m58.9s/2m30.0s

running (1m00.0s), 0500/1000 VUs, 1004 complete and 0 interrupted iterations
default   [  40% ] 0500/1000 VUs  1m00.0s/2m30.0s

running (1m01.0s), 0508/1000 VUs, 1033 complete and 0 interrupted iterations
default   [  41% ] 0508/1000 VUs  1m01.0s/2m30.0s

running (1m02.0s), 0516/1000 VUs, 1064 complete and 0 interrupted iterations
default   [  41% ] 0516/1000 VUs  1m01.9s/2m30.0s

running (1m03.0s), 0525/1000 VUs, 1093 complete and 0 interrupted iterations
default   [  42% ] 0525/1000 VUs  1m02.9s/2m30.0s

running (1m04.0s), 0533/1000 VUs, 1124 complete and 0 interrupted iterations
default   [  43% ] 0533/1000 VUs  1m04.0s/2m30.0s

running (1m05.0s), 0541/1000 VUs, 1154 complete and 0 interrupted iterations
default   [  43% ] 0541/1000 VUs  1m04.9s/2m30.0s

running (1m05.9s), 0550/1000 VUs, 1185 complete and 0 interrupted iterations
default   [  44% ] 0550/1000 VUs  1m05.9s/2m30.0s

running (1m06.9s), 0558/1000 VUs, 1216 complete and 0 interrupted iterations
default   [  45% ] 0558/1000 VUs  1m06.9s/2m30.0s

running (1m08.0s), 0566/1000 VUs, 1248 complete and 0 interrupted iterations
default   [  45% ] 0566/1000 VUs  1m07.9s/2m30.0s

running (1m09.0s), 0574/1000 VUs, 1286 complete and 0 interrupted iterations
default   [  46% ] 0574/1000 VUs  1m09.0s/2m30.0s

running (1m10.0s), 0583/1000 VUs, 1323 complete and 0 interrupted iterations
default   [  47% ] 0583/1000 VUs  1m10.0s/2m30.0s

running (1m11.0s), 0591/1000 VUs, 1362 complete and 0 interrupted iterations
default   [  47% ] 0591/1000 VUs  1m10.9s/2m30.0s

running (1m12.0s), 0599/1000 VUs, 1400 complete and 0 interrupted iterations
default   [  48% ] 0599/1000 VUs  1m12.0s/2m30.0s

running (1m13.0s), 0608/1000 VUs, 1439 complete and 0 interrupted iterations
default   [  49% ] 0608/1000 VUs  1m13.0s/2m30.0s

running (1m14.0s), 0616/1000 VUs, 1475 complete and 0 interrupted iterations
default   [  49% ] 0616/1000 VUs  1m14.0s/2m30.0s

running (1m15.0s), 0624/1000 VUs, 1514 complete and 0 interrupted iterations
default   [  50% ] 0624/1000 VUs  1m14.9s/2m30.0s

running (1m16.0s), 0633/1000 VUs, 1552 complete and 0 interrupted iterations
default   [  51% ] 0633/1000 VUs  1m16.0s/2m30.0s

running (1m17.0s), 0641/1000 VUs, 1589 complete and 0 interrupted iterations
default   [  51% ] 0641/1000 VUs  1m17.0s/2m30.0s

running (1m18.0s), 0649/1000 VUs, 1634 complete and 0 interrupted iterations
default   [  52% ] 0649/1000 VUs  1m18.0s/2m30.0s

running (1m19.0s), 0658/1000 VUs, 1680 complete and 0 interrupted iterations
default   [  53% ] 0658/1000 VUs  1m18.9s/2m30.0s

running (1m20.0s), 0666/1000 VUs, 1723 complete and 0 interrupted iterations
default   [  53% ] 0666/1000 VUs  1m19.9s/2m30.0s

running (1m21.0s), 0674/1000 VUs, 1771 complete and 0 interrupted iterations
default   [  54% ] 0674/1000 VUs  1m20.9s/2m30.0s

running (1m22.0s), 0683/1000 VUs, 1811 complete and 0 interrupted iterations
default   [  55% ] 0683/1000 VUs  1m21.9s/2m30.0s

running (1m23.0s), 0691/1000 VUs, 1848 complete and 0 interrupted iterations
default   [  55% ] 0691/1000 VUs  1m22.9s/2m30.0s

running (1m23.9s), 0699/1000 VUs, 1887 complete and 0 interrupted iterations
default   [  56% ] 0699/1000 VUs  1m23.9s/2m30.0s

running (1m24.9s), 0708/1000 VUs, 1925 complete and 0 interrupted iterations
default   [  57% ] 0708/1000 VUs  1m24.9s/2m30.0s

running (1m26.0s), 0716/1000 VUs, 1965 complete and 0 interrupted iterations
default   [  57% ] 0716/1000 VUs  1m25.9s/2m30.0s

running (1m27.0s), 0724/1000 VUs, 2004 complete and 0 interrupted iterations
default   [  58% ] 0724/1000 VUs  1m26.9s/2m30.0s

running (1m28.0s), 0733/1000 VUs, 2050 complete and 0 interrupted iterations
default   [  59% ] 0733/1000 VUs  1m27.9s/2m30.0s

running (1m28.9s), 0741/1000 VUs, 2096 complete and 0 interrupted iterations
default   [  59% ] 0741/1000 VUs  1m28.9s/2m30.0s

running (1m30.0s), 0749/1000 VUs, 2143 complete and 0 interrupted iterations
default   [  60% ] 0749/1000 VUs  1m30.0s/2m30.0s

running (1m31.0s), 0758/1000 VUs, 2189 complete and 0 interrupted iterations
default   [  61% ] 0758/1000 VUs  1m31.0s/2m30.0s

running (1m32.0s), 0766/1000 VUs, 2236 complete and 0 interrupted iterations
default   [  61% ] 0766/1000 VUs  1m32.0s/2m30.0s

running (1m33.0s), 0774/1000 VUs, 2282 complete and 0 interrupted iterations
default   [  62% ] 0774/1000 VUs  1m33.0s/2m30.0s

running (1m34.0s), 0783/1000 VUs, 2328 complete and 0 interrupted iterations
default   [  63% ] 0783/1000 VUs  1m33.9s/2m30.0s

running (1m35.0s), 0791/1000 VUs, 2375 complete and 0 interrupted iterations
default   [  63% ] 0791/1000 VUs  1m35.0s/2m30.0s

running (1m36.0s), 0799/1000 VUs, 2421 complete and 0 interrupted iterations
default   [  64% ] 0799/1000 VUs  1m36.0s/2m30.0s

running (1m37.0s), 0808/1000 VUs, 2476 complete and 0 interrupted iterations
default   [  65% ] 0808/1000 VUs  1m36.9s/2m30.0s

running (1m38.0s), 0816/1000 VUs, 2529 complete and 0 interrupted iterations
default   [  65% ] 0816/1000 VUs  1m38.0s/2m30.0s

running (1m39.0s), 0824/1000 VUs, 2581 complete and 0 interrupted iterations
default   [  66% ] 0824/1000 VUs  1m39.0s/2m30.0s

running (1m40.0s), 0833/1000 VUs, 2637 complete and 0 interrupted iterations
default   [  67% ] 0833/1000 VUs  1m39.9s/2m30.0s

running (1m41.0s), 0841/1000 VUs, 2684 complete and 0 interrupted iterations
default   [  67% ] 0841/1000 VUs  1m40.9s/2m30.0s

running (1m42.0s), 0849/1000 VUs, 2730 complete and 0 interrupted iterations
default   [  68% ] 0849/1000 VUs  1m41.9s/2m30.0s

running (1m43.0s), 0858/1000 VUs, 2779 complete and 0 interrupted iterations
default   [  69% ] 0858/1000 VUs  1m42.9s/2m30.0s

running (1m44.0s), 0866/1000 VUs, 2823 complete and 0 interrupted iterations
default   [  69% ] 0866/1000 VUs  1m43.9s/2m30.0s

running (1m45.0s), 0874/1000 VUs, 2872 complete and 0 interrupted iterations
default   [  70% ] 0874/1000 VUs  1m44.9s/2m30.0s

running (1m46.0s), 0883/1000 VUs, 2920 complete and 0 interrupted iterations
default   [  71% ] 0883/1000 VUs  1m45.9s/2m30.0s

running (1m47.0s), 0891/1000 VUs, 2974 complete and 0 interrupted iterations
default   [  71% ] 0891/1000 VUs  1m47.0s/2m30.0s

running (1m48.0s), 0899/1000 VUs, 3026 complete and 0 interrupted iterations
default   [  72% ] 0899/1000 VUs  1m47.9s/2m30.0s

running (1m49.0s), 0908/1000 VUs, 3084 complete and 0 interrupted iterations
default   [  73% ] 0908/1000 VUs  1m48.9s/2m30.0s

running (1m50.0s), 0916/1000 VUs, 3136 complete and 0 interrupted iterations
default   [  73% ] 0916/1000 VUs  1m49.9s/2m30.0s

running (1m51.0s), 0924/1000 VUs, 3192 complete and 0 interrupted iterations
default   [  74% ] 0924/1000 VUs  1m50.9s/2m30.0s

running (1m52.0s), 0932/1000 VUs, 3249 complete and 0 interrupted iterations
default   [  75% ] 0932/1000 VUs  1m51.9s/2m30.0s

running (1m53.0s), 0941/1000 VUs, 3302 complete and 0 interrupted iterations
default   [  75% ] 0941/1000 VUs  1m52.9s/2m30.0s

running (1m54.0s), 0949/1000 VUs, 3357 complete and 0 interrupted iterations
default   [  76% ] 0949/1000 VUs  1m53.9s/2m30.0s

running (1m55.0s), 0957/1000 VUs, 3412 complete and 0 interrupted iterations
default   [  77% ] 0957/1000 VUs  1m54.9s/2m30.0s

running (1m56.0s), 0966/1000 VUs, 3473 complete and 0 interrupted iterations
default   [  77% ] 0966/1000 VUs  1m56.0s/2m30.0s

running (1m57.0s), 0974/1000 VUs, 3536 complete and 0 interrupted iterations
default   [  78% ] 0974/1000 VUs  1m57.0s/2m30.0s

running (1m58.0s), 0982/1000 VUs, 3596 complete and 0 interrupted iterations
default   [  79% ] 0982/1000 VUs  1m58.0s/2m30.0s

running (1m59.0s), 0991/1000 VUs, 3661 complete and 0 interrupted iterations
default   [  79% ] 0991/1000 VUs  1m59.0s/2m30.0s

running (2m00.0s), 0999/1000 VUs, 3716 complete and 0 interrupted iterations
default   [  80% ] 0999/1000 VUs  2m00.0s/2m30.0s

running (2m01.0s), 1000/1000 VUs, 3770 complete and 0 interrupted iterations
default   [  81% ] 1000/1000 VUs  2m01.0s/2m30.0s

running (2m02.0s), 1000/1000 VUs, 3828 complete and 0 interrupted iterations
default   [  81% ] 1000/1000 VUs  2m01.9s/2m30.0s

running (2m03.0s), 1000/1000 VUs, 3881 complete and 0 interrupted iterations
default   [  82% ] 1000/1000 VUs  2m02.9s/2m30.0s

running (2m04.0s), 0999/1000 VUs, 3935 complete and 0 interrupted iterations
default   [  83% ] 0999/1000 VUs  2m04.0s/2m30.0s

running (2m05.0s), 0991/1000 VUs, 3992 complete and 0 interrupted iterations
default   [  83% ] 0991/1000 VUs  2m04.9s/2m30.0s

running (2m06.0s), 0982/1000 VUs, 4058 complete and 0 interrupted iterations
default   [  84% ] 0982/1000 VUs  2m05.9s/2m30.0s

running (2m07.0s), 0974/1000 VUs, 4118 complete and 0 interrupted iterations
default   [  85% ] 0974/1000 VUs  2m07.0s/2m30.0s

running (2m08.0s), 0963/1000 VUs, 4181 complete and 0 interrupted iterations
default   [  85% ] 0963/1000 VUs  2m07.9s/2m30.0s

running (2m09.0s), 0946/1000 VUs, 4246 complete and 0 interrupted iterations
default   [  86% ] 0946/1000 VUs  2m08.9s/2m30.0s

running (2m10.0s), 0930/1000 VUs, 4309 complete and 0 interrupted iterations
default   [  87% ] 0930/1000 VUs  2m10.0s/2m30.0s

running (2m11.0s), 0913/1000 VUs, 4374 complete and 0 interrupted iterations
default   [  87% ] 0913/1000 VUs  2m11.0s/2m30.0s

running (2m12.0s), 0895/1000 VUs, 4433 complete and 0 interrupted iterations
default   [  88% ] 0895/1000 VUs  2m12.0s/2m30.0s

running (2m13.0s), 0869/1000 VUs, 4498 complete and 0 interrupted iterations
default   [  89% ] 0869/1000 VUs  2m12.9s/2m30.0s

running (2m14.0s), 0844/1000 VUs, 4561 complete and 0 interrupted iterations
default   [  89% ] 0844/1000 VUs  2m14.0s/2m30.0s

running (2m15.0s), 0821/1000 VUs, 4629 complete and 0 interrupted iterations
default   [  90% ] 0821/1000 VUs  2m14.9s/2m30.0s

running (2m16.0s), 0789/1000 VUs, 4701 complete and 0 interrupted iterations
default   [  91% ] 0789/1000 VUs  2m15.9s/2m30.0s

running (2m17.0s), 0756/1000 VUs, 4770 complete and 0 interrupted iterations
default   [  91% ] 0756/1000 VUs  2m16.9s/2m30.0s

running (2m18.0s), 0725/1000 VUs, 4841 complete and 0 interrupted iterations
default   [  92% ] 0725/1000 VUs  2m18.0s/2m30.0s

running (2m19.0s), 0692/1000 VUs, 4905 complete and 0 interrupted iterations
default   [  93% ] 0692/1000 VUs  2m19.0s/2m30.0s

running (2m20.0s), 0660/1000 VUs, 4964 complete and 0 interrupted iterations
default   [  93% ] 0660/1000 VUs  2m20.0s/2m30.0s

running (2m21.0s), 0627/1000 VUs, 5020 complete and 0 interrupted iterations
default   [  94% ] 0627/1000 VUs  2m20.9s/2m30.0s

running (2m22.0s), 0596/1000 VUs, 5071 complete and 0 interrupted iterations
default   [  95% ] 0596/1000 VUs  2m22.0s/2m30.0s

running (2m23.0s), 0562/1000 VUs, 5129 complete and 0 interrupted iterations
default   [  95% ] 0562/1000 VUs  2m23.0s/2m30.0s

running (2m24.0s), 0528/1000 VUs, 5177 complete and 0 interrupted iterations
default   [  96% ] 0528/1000 VUs  2m24.0s/2m30.0s

running (2m25.0s), 0494/1000 VUs, 5232 complete and 0 interrupted iterations
default   [  97% ] 0494/1000 VUs  2m25.0s/2m30.0s

running (2m26.0s), 0462/1000 VUs, 5288 complete and 0 interrupted iterations
default   [  97% ] 0462/1000 VUs  2m25.9s/2m30.0s

running (2m27.0s), 0433/1000 VUs, 5339 complete and 0 interrupted iterations
default   [  98% ] 0433/1000 VUs  2m27.0s/2m30.0s

running (2m28.0s), 0406/1000 VUs, 5383 complete and 0 interrupted iterations
default   [  99% ] 0406/1000 VUs  2m27.9s/2m30.0s

running (2m29.0s), 0370/1000 VUs, 5434 complete and 0 interrupted iterations
default   [  99% ] 0370/1000 VUs  2m29.0s/2m30.0s

running (2m30.0s), 0329/1000 VUs, 5483 complete and 0 interrupted iterations
default   [ 100% ] 0329/1000 VUs  2m30.0s/2m30.0s

running (2m31.0s), 0289/1000 VUs, 5523 complete and 0 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m32.0s), 0248/1000 VUs, 5564 complete and 0 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m33.0s), 0210/1000 VUs, 5602 complete and 0 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m34.0s), 0171/1000 VUs, 5641 complete and 0 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m35.0s), 0145/1000 VUs, 5666 complete and 1 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m36.0s), 0125/1000 VUs, 5686 complete and 1 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m37.0s), 0104/1000 VUs, 5706 complete and 2 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m38.0s), 0091/1000 VUs, 5719 complete and 2 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m39.0s), 0087/1000 VUs, 5722 complete and 3 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m40.0s), 0084/1000 VUs, 5725 complete and 3 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m41.0s), 0082/1000 VUs, 5725 complete and 5 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m42.0s), 0080/1000 VUs, 5727 complete and 5 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m43.0s), 0067/1000 VUs, 5740 complete and 5 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m44.0s), 0053/1000 VUs, 5754 complete and 5 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m45.0s), 0038/1000 VUs, 5769 complete and 5 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m46.0s), 0024/1000 VUs, 5783 complete and 5 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s

running (2m47.0s), 0009/1000 VUs, 5798 complete and 5 interrupted iterations
default ↓ [ 100% ] 0328/1000 VUs  2m30s


  █ TOTAL RESULTS 

    checks_total.......: 5808   34.658536/s
    checks_succeeded...: 38.22% 2220 out of 5808
    checks_failed......: 61.77% 3588 out of 5808

    ✗ status is 200 or 201
      ↳  38% — ✓ 2220 / ✗ 3588

    HTTP
    http_req_duration..............: avg=13.58s min=68.86ms med=18.03s max=1m0s   p(90)=18.04s p(95)=18.04s
      { expected_response:true }...: avg=3.71s  min=68.86ms med=2.08s  max=59.71s p(90)=5.17s  p(95)=5.32s 
    http_req_failed................: 61.77% 3588 out of 5808
    http_reqs......................: 5808   34.658536/s

    EXECUTION
    iteration_duration.............: avg=14.58s min=1.06s   med=19.03s max=1m1s   p(90)=19.04s p(95)=19.04s
    iterations.....................: 5807   34.652569/s
    vus............................: 9      min=8            max=1000
    vus_max........................: 1000   min=1000         max=1000

    NETWORK
    data_received..................: 697 kB 4.2 kB/s
    data_sent......................: 2.2 MB 13 kB/s



running (2m47.6s), 0000/1000 VUs, 5807 complete and 5 interrupted iterations
default ✓ [ 100% ] 0000/1000 VUs  2m30s